//ЭО = экземпляр объекта

//Опишите функцию конструктор для создания товаров(GOOD) - свойства - (icon,name, price, quantity)
//Опишите методы на прототипе buy, sell, toString, valueOf, getSum
//1. Buy - увеличивает quantity на 1
//2. Sell - уменьшает quantity на 1
//3.toString - выводит контретный товар в таблицу в одной строке, в разных ячейках - имя свойства + значение
//4. valueOf - возвращает цену товара.
//5. getSum - вызывается на одном ЭО, как параметр получает другой. Возвращает сумму этих ЭО.
//Создайте 4-5 ЭО.
//Создайте функцию которая будет иллюстрировать действие getSum. (Проявите фантазию, вывод может происходить через другой объект, например Cart(Корзина))
//Создайте ф-цию renderShop - которая выводит все товары, каждый товар в див
/*<div class='item'>
	<div class='itemIcon'>icon</div>
	<h3>name</h3>
	<h4>price</h4>
</div>*/
//