/*Создайте Класс GOOD
свойства isAvailable, shop метод chekAvailability*/
/*Создайте дочерний классы laptop, phone, computer
у них создать 3 публичных свойства, 2 публичных метода, 
по 2 приватных метода*/
/*1. Реализовать наследование через установку
 экхемпляра родителя как протипипа потомка*/
/*2. Реализовать наследование используя указание контекста
 выполнения для конструктора родителя*/
/*3. Использовать Оbject.create для 
указания прототипа для дочерних классов
Сами дочерние классы наполнить ТОЛЬКО используя Object.defineProperties
приватные методы описать отдельно от объекта. 
Используя методы привязки контекста привязать их к конкретным объектам*/
/*Создайти по 3 экз объекта дочерних классов
Выведите в документ в 
<div id="shop">

	//Этот фрагмент повторяется для каждой группы товаров
	//(т.е.) для каждого набора ЭО дочерних классов
	<h2>Good type</h2>
	<div class="goodsWrapper">
		<div class="good">
			<div class="icon">
				<img src='path/to/icon'>
			</div>
			<h3>Good name</h3>
			<h4>Good price</h3>
		</div>
	</div>

</div>	
*/
/* отрисовкой разметки занимается отдельная функция*/
