//Просьба - залейте на репощиторий и в настройках включите доступность на мастер бранч(блок GithubPages) - и скиньте ссылку по которой доступен реп
// чтобы я мог не стягивая репозиторий сразу смотреть.

/*1 Напишите функции :
- 1 - удаляет из ДОМ структуры все узлы которые не елемент(метод removeChild), возращает массив елементов.
- 2 - возвращает в виде массива узлы только типа коммент
*/

/*2
Создайте div, a, ul>li*5
у дива, ссылки и ул есть ИД
Напишите функцию
- 1 - выводит промпт с вопросом "с каким элементом вы хотите взаимодействовать"(напишите перечень ид, я буду пробовать), вы вводите ид получаете к нему доступ
(если это список - доп вопрос к какому по счёту элементу списка применятся действия)
следущий промпт  спрашивает "что вы хотите изменить (a - аттрибут, s - стили)"
- для аатрибута - спрашивает - что вы хотите сделать(установить, удалить, отредактировать) - если установить или редактировать - то 2 промпта спрашивают имя атрибута и значение, для удаления только имя
- для стилей - промпт принимает значение как и аттрибут style , т.е. 'width:20px;height:20px' и т.д. - как реализовывать - на ваше усмотрение
*/
