/*
1 - отследить распространение клика на таблице и если он 
произошел на ячейке - покрасить её в желтый
произошел на строке - строку в оранжевый
если на теле таблицы - в красный

2 - для блока mouse обработайте наведение на него
при наведении на блок он отъезжает от курсора в какую-либо из сторон
(вверх, вниз, влево, вправо)

3 - для блока keyboard реализуйте его передвижение стрелками клавиатуры


4 - для input сделайте доступным ввод только букв английского языка в
в нижнем и верхнем регистрах
*/
